<?php
    return[
        'Title_Main' => 'Ruslan Isakov',
        'Banner' => [
            'Hello' => 'Здравствуйте',
            'Banner_Main_01' => 'Ruslan',
            'Banner_Main_02' => 'ISAKOV',
            'Banner_Text_01' => 'Меня зовут Руслан Исаков',
            'Banner_Text_02' => 'Меня зовут Руслан Исаков',
            'Contacts' => 'Контакты',
        ],

        'Menu' => [
            'Home' => 'Главная',
            'About' => 'Обо мне',
            'Experience' => 'Опыт работы',
            'Education' => 'Образование',
            'Portfolio' => 'Портфолио',
            'Certificates' => 'Сертификаты',
            'Recommendations' => 'Рекомендации',
            'Contacts' => 'Контакты'
        ],

        'Auth' => [
            'Auth' => 'Авторизация',
            'Hello' => 'Привет',
            'Signin' => 'Войти',
            'Logout' => 'Выход',
            'Password' => 'Пароль',
            'Email' => 'Email',
            'Login' => 'Войти',
            'Question' => 'Вы уверены, что хотите выйти?',
            'Yes' => 'Да',
            'No' => 'Нет',
        ],

        'Registr' => [
            'Reg' => 'Регистрация',
            'Login' => 'Логин',
            'Email' => 'Email',
            'Password' => 'Пароль',
            'Conf_Password' => 'Подтвердите пароль',
            'Signup' => 'Зарегистрироваться',
        ],

        'About' =>[
            'About_Title' => 'Пару слов обо мне...',
            'About_Hello' => 'Здравствуйте!',
            'About_Text_01' => 'Меня зовут Исаков Руслан. Расскажу не много о себе… ',
            'About_Text_02' => 'Я самый обычный парень, старающаяся оптимистично относиться к жизни.
                                Я постоянно учусь новому: читаю много разных книг, смотрю кино, знакомлюсь с новыми людьми, разговариваю с ними,
                                задаю вопросы компетентным людям. Мне интересно жить и питаться информацией.',
            'About_Text_03' => 'Зачем я это делаю?',
            'About_Text_04' => 'Во-первых, потому что я энергичный, добросовестный, постоянно работающий над собой человек и стараюсь свою энергию
                                пускать в правильное русло. ',
            'About_Text_05' => 'Во-вторых, современный мир диктует свои правила, где знания и информация ценятся крайне высоко и являются важной составляющей успеха. ',
            'About_Text_06' => 'В-третьих, это повышает мою стоимость (без кавычек!), как специалиста. Кроме того, я наслаждаюсь общением с умными,
                                образованными, талантливыми людьми, поэтому я всегда стараюсь расти, чтобы интерес был обоюдным.',
            'About_Text_07' => 'Я с детства очень любил компьютеры, физику и математику. Из этого и родился мой интерес к программированию.
                                Разработкой я занимаюсь с 15 лет, начинал с малого, делая сайты, визитки на фрилансе. За это время получил очень большой опыт
                                и развил очень много навыков. В настоящее время владею следующими навыками:',
            'About_Text_Item_01' => 'Отличные знания HTML, CSS, Bootstrap;',
            'About_Text_Item_02' => 'Разработка на PHP (Laravel, Bitrix);',
            'About_Text_Item_03' => 'Знание ООП и MVC; ',
            'About_Text_Item_04' => 'Владею JavaScript (Ajax, jQuery);',
            'About_Text_Item_05' => 'Умение работать с GIT, github и т.д.;',
            'About_Text_Item_06' => 'Написание сложных и оптимизированных запросов на SQL (MySql, MS Sql);',
            'About_Text_Item_07' => 'Разработка приложений на C# и Python;',
            'About_Text_Item_08' => 'Владение английским на уровне чтения технической документации;',
            'About_Text_Item_09' => 'Разработка макетов WEB-сайтов;',
            'About_Text_Item_10' => 'Создание 2D и 3D видео-контента любой сложности;',
            'About_Text_Item_11' => 'Монтаж видео-контента;',
            'About_Text_Item_12' => 'Графический дизайн (2D и 3D);',
            'About_Text_Item_13' => 'Cinema 4D, Adobe After Effects, Adobe Audition, Adobe illustrator, CorelDraw и т.д.',
            'About_Text_Item_14' => 'Ремонт и обслуживание ПК.',
            'Download_CV' => 'Скачать резюме',
            'View_CV' => 'Просмотреть резюме',
            'About_Icon_01' => 'WEB разработчик',
            'About_Icon_02' => 'Инженер-программист',
            'About_Icon_03' => 'Разработчик баз данных',
            'About_Icon_04' => '3D Аниматор',
            'About_Icon_05' => 'Графический Дизайнер',
            'About_Icon_06' => 'WEB Дизайнер',
        ],

        'Education' => [
            'Title' => 'Образование',
            'Block_01' => [
                'Name' => 'Школа гимназия №17 имени А.С.Пушкина',
                'Description' => '',
                'Speciality' => '',
                'Year' => 'Сентябрь 2008 - Июнь 2017'
            ],
            'Block_02' => [
                'Name' => 'Корейский Центр Образования',
                'Description' => 'Курсы графического дизайна',
                'Speciality' => 'Графический Дизайнер',
                'Year' => 'Сентябрь 2017 - Декабрь 2017'
            ],
            'Block_03' => [
                'Name' => 'Политехнический Колледж при Международном Университете Кыргызской Республики(ПК МУКР)',
                'Description' => '',
                'Speciality' => 'Техник-программист',
                'Year' => 'Сентябрь 2017 - Июнь 2020',
            ],
            'Block_04' => [
                'Name' => 'Международный Университет Кыргызской Республики (МУКР)',
                'Description' => '',
                'Speciality' => 'Инженер-программист',
                'Year' => 'Сентябрь 2020 - ...',
            ]
        ],

        'Experience' => [
            'Title' => 'Опыт работы',
            'Duties' => 'Обязанности:',
            'Achievements' => 'Достижения:',
            'Block_01' => [
                'Name' => 'Impuls Animation',
                'Speciality' => '3D Дизайнер и Программист',
                'Date_Start' => 'Май 2019',
                'Date_End' => 'Октябрь 2021',
                'Description_01' => [
                    'Item_01' => 'Контроль за работой отдела;',
                    'Item_02' => 'Разработка новых скриптов;',
                    'Item_03' => 'Анализ и оптимизация данных;',
                    'Item_04' => 'Разработка Front-End и Back-End частей;',
                    'Item_05' => 'Взаимодействие с заказчиками;',
                    'Item_06' => 'Разработка 2D и 3D видеоконтента.',
                ],
                'Description_02' => [
                    'Item_01' => 'Принял участие в разработке десятков крупнейших проектов. В их числе War Gaming и СберБанк;',
                    'Item_02' => 'Оптимизировал работу отдела.',
                ],
            ],
            'Block_02' => [
                'Name' => 'Кондитерский Дом Куликовский',
                'Speciality' => 'Программист',
                'Date_Start' => 'Октябрь 2021',
                'Date_End' => '...',
                'Description_01' => [
                    'Item_01' => 'Разработка Front-End и Back-End частей;',
                    'Item_02' => 'Разработка модулей и сервисов под ключ;',
                    'Item_03' => 'Доработка и оптимизация существующего кода;',
                    'Item_04' => 'Интеграция с сервисами, как разработанными внутри компании, так и сторонними;',
                    'Item_05' => 'Разработка и внедрение новых проектов компании;',
                    'Item_06' => 'Разработка баз данных (MySQL, MS SQL).',
                ],
                'Description_02' => [
                    'Item_01' => 'Перевел все web-сервисы компании с PHP 5.4 на PHP 7.4;',
                    'Item_02' => 'Определил области улучшения кодовой базы и внес свой вклад в улучшение производительности и скорости работы сервисов компании;',
                    'Item_03' => 'Внедрил систему контроля версий Git.',
                ],
            ],
        ],

        'Portfolio' => [
            'Title' => 'Портфолио',
            'View_Block_Text' => 'Нажмите на Блок, чтобы увидеть мои работы',
            'Block_01' => [
                'Title' => 'Web Разработка'
            ],
            'Block_02' => [
                'Title' => 'Программирование'
            ],
            'Block_03' => [
                'Title' => '3D Анимация'
            ],
        ],

        'Certificates' => [
            'Title' => 'Сертификаты',
            'Verify_Text' => 'Нажмите, чтобы подтвердить мой сертификат',
            'Cert_None' => 'Отсутствует',
            'Cert_01' => [
                'Title' => 'Графический Дизайнер',
                'Description' => 'Сертификат, выданный Корейским образовательным центром. Курсы графического дизайна (PhotoShop, Corel Draw, иллюстратор)',
            ],
            'Cert_02' => [
                'Title' => 'Студент года',
                'Description' => 'Сертификат, выданный Политехническим колледжем Международного университета Кыргызской Республики.
                                  «Лучший студент, золотой кадровый резерв страны»',
            ],
            'Cert_03' => [
                'Title' => 'Благодарственное письмо',
                'Description' => 'Благодарственное письмо от заказчика. (Разработка и продвижение сайта)',
            ],
        ],

        'Recommendations' => [
            'Title' => 'Рекомендации',
            'Respectfully' => 'С уважением',
            'Block_01' => [
                'Name' => 'Комарова Александра',
                'Full_Name' => 'Комарова Александра Андреевна',
                'Position' => '(Директор спортивного комплекса «Миллениум»)',
                'Description_01' => 'В этом письме спортивный клуб Millenium выражает благодарность Исакову Руслану Рустановичу за ответственный и
                                     индивидуальный подход к нашему проекту: разработка, запуск и продвижение сайта Millenium.org.kg.',
                'Description_02' => 'За время совместной работы Исаков Руслан проявил профессионализм, внимательность и оперативность в выполнении поставленных задач.',
                'Description_03' => 'Все наши запросы и пожелания в процессе разработки сайта были учтены и выполнены в срок. Мы удовлетворены качеством
                                     выполненной Русланом работы и рекомендуем его как надежного и ответственного WEB-программиста.',
                'Date' => 'Январь 24, 2019'
            ],
            'Block_02' => [
                'Name' => 'Бубнева Вера',
                'Full_Name' => 'Бубнева Вера',
                'Position' => '(Заведующая кафедрой «Программирование компьютерных систем» Политехнического колледжа Международного университета Кыргызской Республики)',
                'Description_01' => 'Исаков Руслан Рустанович окончил Политехнический Колледж при Международном
                                     Университете Кыргызской Республики с красным дипломом в июне 2020 года.
                                     За годы обучения он проявил себя ответственным и целеустремленным студентом,
                                     который стремится не просто накапливать знания, но и применять их на практике.',
                'Description_02' => 'Руслан учился на отлично и принимал активное участие в жизни колледжа.
                                     На первом курсе был старостой своей группы. Помогал своим одногруппникам по учебе и отстаивал интересы группы.',
                'Date' => 'Декабрь 12, 2019'
            ],
            'Block_03' => [
                'Name' => 'Шабловский Александр',
                'Full_Name' => 'Шабловский Александр Витальевич',
                'Position' => '(Директор ОсОО "Impuls Animation")',
                'Description_01' => 'Я подтверждаю, что Исаков Руслан Рустанович работал в компании ОсОО «Impuls Animation» в должности 3D дизайнера/программиста
                                     в период с 1 мая 2019 г. по 18 октября 2021 г.',
                'Description_02' => 'С самых первых дней появления в компании показал себя как исполнительный и ответственный человек, не боящийся трудностей
                                     и стремящийся к получению новых знаний. В первые месяцы работы овладел новыми навыками и знаниями. В частности изучил:
                                     Adobe After Effects для монтажа, основы моделинга в Cinema4D, Adobe Audition для работы со звуковой частью проектов,
                                     повысил свои навыки в анимации до высокого уровня.',
                'Description_03' => 'Также начал проявлять активность по улучшению технологических особенностей и структурности компании, предложил, а затем успешно внедрил процесс оптимизации командной работы отдела.',
                'Description_04' => 'В ходе своего развития был повышен и занялся управлением малых проектов, а затем и международных, с такими компаниями как War Gaming и СберБанк.
                                     В его обязанности входило:',
                'Description_04_Items' => [
                    'Item_01' => '•	создание 2D и 3D анимации;',
                    'Item_02' => '•	монтаж видео-контента;',
                    'Item_03' => '•	сведение аудио-дорожек для проектов;',
                    'Item_04' => '•	разработка скриптов для моделей;',
                    'Item_05' => '•	разработка Front-End и Back-End частей WEB проектов;',
                    'Item_06' => '•	управление и ведение проектов.',
                ],
                'Description_05' => 'За время работы в компании выполнял свои обязанности на высоком профессиональном уровне.
                                     Особенно хочется отметить его высокую работоспособность, умение работать с большими объемами информации,
                                     исполнительность, внимательность, честность, умение находить и налаживать контакты с сотрудниками и партнерами.
                                     Благодаря своим знаниям, работоспособности и желанию развиваться, он в короткие сроки сумел достичь больших успехов
                                     в улучшении компании.',
                'Description_06' => 'Я благодарен Руслану за успешное сотрудничество.',
                'Date' => 'Октябрь 18, 2021'
            ],
        ],

        'Contacts' => [
            'Title' => 'Связаться со мной',
            'Surname' => 'Фамилия',
            'Name' => 'Имя',
            'Phone' => 'Номер телефона',
            'E-mail' => 'E-mail',
            'Subject' => 'Тема',
            'Message' => 'Сообщение',
            'Submit' => 'Отправить',
        ],

        'Footer' => [
            'Phone_number' => '+996-776-000-512',
            'Created' => '© 2019-2022 RI. Все права защищены | Разработка'
        ]
    ];
