<?php
return[
    'Title_Main' => 'Ruslan Isakov',
    'Isakov' => 'Isakov',
    'Ruslan' => 'Ruslan',
    'Hello'  => 'Здравствуйте!',
    'Menu'   => [
        'item_01' => 'Главная',
        'item_02' => 'Обо мне',
        'item_03' => 'Hard skills',
        'item_04' => 'Soft skills',
        'item_05' => 'Опыт работы',
        'item_06' => 'Образование',
        'item_07' => 'Портфолио',
        'item_08' => 'Документы',
        'item_09' => 'Рекомендации',
        'item_10' => 'Связь со мной',
    ],
    'Auth' => [
        'Auth'     => 'Авторизация',
        'Hello'    => 'Привет',
        'Signin'   => 'Войти',
        'Logout'   => 'Выход',
        'Password' => 'Пароль',
        'Email'    => 'Email',
        'Login'    => 'Войти',
        'Question' => 'Вы уверены, что хотите выйти?',
        'Yes'      => 'Да',
        'No'       => 'Нет',
    ],
    'Registr' => [
        'Reg'           => 'Регистрация',
        'Login'         => 'Логин',
        'Email'         => 'Email',
        'Password'      => 'Пароль',
        'Conf_Password' => 'Подтвердите пароль',
        'Signup'        => 'Зарегистрироваться',
    ],
    'About_block' => [
        'text_01'   => 'Меня зовут Руслан Исаков и я являюсь профессионалом в области программирования с опытом более 5 лет.
                            И так же, как и Вы, я всегда задумывался о своем будущем, ставил амбициозные цели, хотел узнавать новое, совершенствоваться.',
        'text_02'   => 'Но на все свои проявления от окружающих я лишь получал критику, насмешки. Мне все говорили: «Ой, куда ты лезешь?», «У тебя не получится!»,
                            «Это невозможно»',
        'text_03'   => 'Слушая все это, я для себя решил, что я буду неудачником . . . ,',
        'text_03_1' => 'если перестану следовать своей',
        'text_03_2' => 'МЕЧТЕ!!!',
        'text_04'   => 'И с того момента моя жизнь начала меняться в лучшую сторону, и сегодня я с уверенностью иду к своим мечтам, невзирая на ошибки, падения
                            и мнения окружающих.',
        'text_04'   => 'Я постоянно учусь новому: читаю много разных книг, знакомлюсь с новыми людьми. Мне интересно жить и питаться информацией.',
        'text_05'   => 'Зачем я это делаю?',
        'text_06'   => 'Во-первых, потому что я целеустремленный, энергичный, добросовестный человек, постоянно работающий над собой человек и стараюсь свою энергию
                            направлять в правильное русло.',
        'text_07'   => 'Во-вторых, современный мир диктует свои правила, где знания и информация ценятся крайне высоко и являются важной составляющей успеха.',
        'text_08'   => 'В-третьих, я наслаждаюсь общением с умными, образованными, талантливыми людьми, поэтому я всегда стараюсь расти, чтобы интерес был обоюдным.',
        'text_09'   => 'Я с детства очень любил компьютеры, физику и математику. Из этого и родился мой интерес к программированию. Разработкой я занимаюсь с 15 лет,
                            начинал с малого, делая сайты, визитки на фрилансе. За это время получил очень большой опыт и развил очень много навыков.
                            В настоящее время владею следующими навыками:',
    ],
    'Hard_skills' => [
        'title'       => 'Hard Skills',
        'description' => 'узкие профессиональные навыки, которые нужны для решения конкретных задач в повседневной работе',
        'item_01'     => 'Отличные знания html, css, Bootstrap',
        'item_02'     => 'Владею JavaScript (Ajax, jQuery)',
        'item_03'     => 'Разработка на PHP (Laravel, Bitrix)',
        'item_04'     => 'Знания ООП и MVC',
        'item_05'     => 'Знания Linux (Стек LEMP)',
        'item_06'     => 'Умение работать с Git, github',
        'item_07'     => 'Написание сложных и оптимизированных запросов на SQL (MySQL, Ms SQL)',
        'item_08'     => 'Работа с Docker',
        'item_09'     => 'Знания REST Api',
        'item_10'     => 'ElasticSearch',
        'item_11'     => 'Разработка дизайна WEB-сайтов',
        'item_12'     => 'Разработка макетов WEB-сайтов',
        'item_13'     => 'Создание 2D-3D дизайна и анимации',
        'item_14'     => 'Разработка приложений на C#',
        'item_15'     => 'Основы Python',
        'item_16'     => 'Владение английским на уровне чтения технической документации',
    ],
    'Soft_skills' => [
        'title'       => 'Soft Skills',
        'description' => 'надпрофессиональные навыки, которые помогают решать жизненные задачи и работать с другими людьми',
        'item_01' => [
            'name'        => 'Обучаемость',
            'description' => 'способность человека к целенаправленному освоению знаний',
        ],
        'item_02' => [
            'name'        => 'Целеустремленность',
            'description' => 'способность помнить о намеченных планах и не терять из виду сформулированные цели, умение преодолевать возникшие препятствия
                                  и не опускать руки, встречаясь с трудностями',
        ],
        'item_03' => [
            'name'        => 'Ораторское искусство',
            'description' => 'мастерство влияния и убеждения по средствам речи',
        ],
        'item_04' => [
            'name'        => 'Критическое мышление',
            'description' => 'способность взвешенно подходить к переработке и потреблению информации',
        ],
        'item_05' => [
            'name'        => 'Клиентоориентированность',
            'description' => 'умение вовремя определять потребности и желания своей аудитории, чтобы удовлетворять их с максимальной пользой',
        ],
        'item_06' => [
            'name'        => 'Ненасильственное общение',
            'description' => 'метод четко, понятно и точно доносить до собеседника информацию и добиваться своего',
        ],
        'item_07' => [
            'name'        => 'Принятие решений',
            'description' => 'способность осознанно выбирать лучшее решение из возможных вариантов',
        ],
        'item_08' => [
            'name'        => 'Экологическое мышление',
            'description' => 'способность осознанно относиться к происходящим событиям без вреда для себя и окружающих',
        ],
        'item_09' => [
            'name'        => 'Саморефлексия',
            'description' => 'самостоятельный анализ своих поступков, поведения, деятельности',
        ],
        'item_10' => [
            'name'        => 'Управление проектами',
            'description' => 'проекты везде. сделать сайт, построить дом, организовать путешествие — всё это проекты',
        ],
        'item_11' => [
            'name'        => 'Эмоциональный интеллект',
            'description' => 'способность понимать эмоции, мотивацию, намерения свои и других людей и управлять всем этим',
        ],
        'item_12' => [
            'name'        => 'Наставничество и менторинг',
            'description' => 'наставник поможет составить план обучения и следить за результатами',
        ],
        'item_13' => [
            'name'        => 'Работа в режиме неопределенности',
            'description' => 'умение быстро реагировать на изменения условий задачи, принимать решения,
                                  управлять проектами и своими ресурсами',
        ],
        'item_14' => [
            'name'        => 'Лидерские качества',
            'description' => 'совокупность навыков, знаний, умений, позволяющих личности собирать команду единомышленников и воздействовать на них',
        ],
    ],
    'Work_experience' => [
        'title'                     => 'Опыт работы',
        'responsibilities_header'   => 'Обязанности:',
        'responsibilities_header_2' => 'Проекты:',
        'achievements_header'       => 'Достижения:',
        'item_01' => [
            'name'             => 'Impuls Animation',
            'position'         => 'Программист',
            'responsibilities' => [
                'item_01' => 'Разработка интернет-магазинов',
                'item_02' => 'Разработка информационных WEB-сайтов',
                'item_03' => 'Разработка корпоративных-информационных WEB-сайтов',
                'item_04' => 'Разработка промо-сайтов',
                'item_05' => 'Разработка сайтов визиток',
                'item_06' => 'Взаимодействие с заказчиками',
                'item_07' => 'Доработка и оптимизация существующих проектов',
                'item_08' => 'Управление проектами',
            ],
            'achievements' => [
                'item_01' => 'Принял участие в разработке десятков крупнейших проектов. В их числе War Gaming и СберБанк',
                'item_02' => 'Оптимизировал работу отдела',
            ],
            'date_start' => 'Май 2019',
            'date_end'   => 'Октябрь 2021',
        ],
        'item_02' => [
            'name' => 'Кондитерский Дом Куликовский',
            'position' => 'Программист',
            'responsibilities' => [
                'item_01' => 'Разработка Front-End и Back-End частей',
                'item_02' => 'Разработка баз данных (MySQL, MS SQL)',
                'item_03' => 'Разработка системы Электронного Документооборота',
                'item_04' => 'Разработка обучающей онлайн платформы с возможностью задавать задания ученика и проставлять оценки',
                'item_05' => 'Синхронизация сервисов Bitrix24 с WEB-сервисами компании',
                'item_06' => 'Разработка и внедрение системы «Личный кошелек сотрудника»',
                'item_07' => 'Разработка интернет-магазина «Магазин бенефитов» для сотрудников компании',
                'item_08' => 'Разработка интернет-магазина с каталогом продукции компании',
                'item_09' => 'Разработка интеграций WEB-приложений с 1C',
                'item_10' => 'Разработка и внедрение игры «Тайный Санта»',
                'item_11' => 'Разработка и внедрение онлайн «Аукциона» для благотворительного комитета',
                'item_12' => 'Разработка онлайн платформы для проведения годового собрания с возможностью в режиме онлайн задать вопрос директорам компании',
                'item_13' => 'Разработка системы для автоматического сбора данных о температуре с датчиков 
                              со всех продуктовых складов компании с возможностью уведомления ответственных лиц 
                              в случае превышения указанных показателей, а также с отчетом за любой указанный период 
                              и статистикой в виде графиков',
                'item_14' => 'Разработка системы для сбора и хранения данных о показаниях счетчиков со всего завода 
                              с возможностью вывода отчета и статистикой по имеющимся данным',
                'item_15' => 'Разработка онлайн платформы HR для проведения развлекательных мероприятий',
                'item_16' => 'Создание модулей для автоматического обновления видео-роликов на экранах во всех магазинах города',
                'item_17' => 'Разработка скриптов для Bitrix24',
                'item_18' => 'Доработка и оптимизация существующих сервисов',
                'item_19' => 'Интеграция сервисов между собой (как разработанными внутри компании, так и со сторонними',
            ],
            'achievements' => [
                'item_01' => 'Перевел все Web-сервисы компании с PHP 5.4 на PHP 7.4',
                'item_02' => 'Перевел более 50 документов в систему электронного документооборота, что позволило ускорить работу сотрудников и сократить время подписания договоров, выдачи справок и т.д.',
                'item_03' => 'Определил области улучшения кодовой базы и внес свой вклад в улучшение производительности и скорости работы сервисов компании, производительность выросла в 3 раза',
            ],
            'date_start' => 'Октябрь 2021',
            'date_end'   => '. . .',
        ],
    ],
    'Education' => [
        'title'   => 'Образование',
        'item_01' => [
            'name'       => 'Школа гимназия №17 имени А. С. Пушкина',
            'speciality' => '',
            'faculty'    => '',
            'date_start' => '2008',
            'date_end'   => '2017',
        ],
        'item_02' => [
            'name'       => 'Корейский Центр Образования',
            'speciality' => 'Графический Дизайнер',
            'faculty'    => 'Курсы графического дизайна',
            'date_start' => '2017',
            'date_end'   => '',
        ],
        'item_03' => [
            'name'       => 'Политехнический Колледж при Международном Университете Кыргызской Республики(ПК МУКР)',
            'speciality' => 'Техник-программист',
            'faculty'    => 'Программирование компьютерных систем',
            'date_start' => '2017',
            'date_end'   => '2020',
        ],
        'item_04' => [
            'name'       => 'Международный Университет Кыргызской Республики (МУКР)',
            'speciality' => 'Инженер-программист',
            'faculty'    => 'Программная инженерия',
            'date_start' => '2020',
            'date_end'   => '. . .',
        ],
    ],
    'Portfolio' => [
        'title'       => 'Портфолио',
        'description' => 'Сборник всех моих работ (разделено на блоки)',
        'block_01'    => 'WEB Разработка',
        'block_02'    => 'Приложения',
        'block_03'    => '2D и 3D Анимация',
        'btnText'     => 'Подробнее',
    ],
    'Documents' => [
        'title'   => 'Документы',
        'item_01' => [
            'name'     => 'Графический дизайнер',
            'position' => 'Корейский образовательный центр'
        ],
        'item_02' => [
            'name'     => 'Студент года',
            'position' => 'Международный Университет Кыргызской Республики'
        ],
        'item_03' => [
            'name'     => 'Благодарственное письмо',
            'position' => 'Спортивный Клуб Millenium'
        ],
        'item_04' => [
            'name' => 'Техник-программист',
            'position' => 'Политехнический колледж МУКР'
        ],
    ],
    'Recommendations' => [
        'title' => 'Рекомендации',
        'link'  => 'О студии в СМИ',
        'item_01' => [
            'name' => 'Комарова Александра',
            'text' => [
                '01' => 'В этом письме спортивный клуб Millenium выражает благодарность Исакову Руслану Рустановичу за ответственный и индивидуальный подход
                             к нашему проекту: разработка, запуск и продвижение сайта Millenium.org.kg.',
                '02' => 'За время совместной работы Исаков Руслан проявил профессионализм, внимательность и оперативность в выполнении поставленных задач.
                             Все наши запросы и пожелания в процессе разработки сайта были учтены и выполнены в срок.',
                '03' => 'Мы удовлетворены качеством выполненной Русланом работы и рекомендуем его как надежного и ответственного WEB-программиста.',
            ],
        ],
        'item_02' => [
            'name' => 'Шабловский Александр',
            'text' => [
                '01' => 'Я подтверждаю, что Исаков Руслан Рустанович работал в компании ОсОО «Impuls Animation» в должности 3D дизайнера/программиста
                             в период с 1 мая 2019 г. по 18 октября 2021 г.',
                '02' => 'С самых первых дней появления в компании показал себя как исполнительный и ответственный человек, не боящийся трудностей и стремящийся
                             к получению новых знаний. В первые месяцы работы овладел новыми навыками и знаниями, такими как: монтаж, основы моделинга в Cinema4D,
                             работа со звуком, повысил свои навыки в анимации до высокого уровня.',
                '03' => 'Также начал проявлять активность по улучшению технологических особенностей и структурности компании, предложил,
                             а затем успешно внедрил процесс оптимизации командной работы отдела. В ходе своего развития был повышен и занялся управлением малых проектов,
                             а затем и международных, с такими компаниями как War Gaming и СберБанк.',
                '04' => 'За время работы в компании выполнял свои обязанности на высоком профессиональном уровне.
                             Особенно хочется отметить его целеустремленность, исполнительность, внимательность,
                             честность, умение находить и налаживать контакты с сотрудниками и партнерами.
                             Благодаря своим знаниям, работоспособности и желанию развиваться, он в короткие сроки сумел достичь больших успехов в улучшении компании.',
                '05' => 'Я благодарен Руслану за успешное сотрудничество.',
                '06' => 'С уважением, Шабловский Александр Витальевич (Директор ОсОО "Impuls Animation")',
            ],
        ],
    ],
    'footer_text'       => '© 2019-2022 | Все права защищены',
    'portfolio_present' => 'В описании каждого проекта представлен не весь проект, а только отдельные его части (с целью ознакомиться со структурой)',
];
